<a href="https://colab.research.google.com/github/dharmendra-chouhan/s2datascience/blob/master/Costing_Sheet_Dec_2019_with_All_annexures.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
#@title *Read a Excel file from a Google drive** {display-mode: "form"}
!pip install -U -q PyDrive
from pydrive.auth import GoogleAuth
from pydrive.drive import GoogleDrive
from google.colab import auth
from oauth2client.client import GoogleCredentials

# 1. Authenticate and create the PyDrive client.
auth.authenticate_user()
gauth = GoogleAuth()
gauth.credentials = GoogleCredentials.get_application_default()
drive = GoogleDrive(gauth)

#2. Get the file Cosolidated sheet for Dec 2019_Annexure-3.xlsx
downloaded = drive.CreateFile({'id':'1c_dTYm16Vp9JhvB2EUu8A7x0E6869Vtj'}) # replace the id with id of file you want to access
downloaded.GetContentFile('Cosolidated sheet for Dec 2019_Annexure-3.xlsx')  

# HLL Expenses Summary-Annexure-II.xlsx
downloaded = drive.CreateFile({'id':'1NaFIGXdD7WMiMIpjkkNSCi2m4YOtSIR9'}) # replace the id with id of file you want to access
downloaded.GetContentFile('HLL Expenses Summary-Annexure-II.xlsx')

# Lab Wise Business Report_Annexure-I.xls
downloaded = drive.CreateFile({'id':'1W31V3JFrzJDpcOIOHlpCY6ETrfxTU5Ue'}) # replace the id with id of file you want to access
downloaded.GetContentFile('Lab Wise Business Report_Annexure-I.xls')

# Rent for Dec 19_Annexure-5.xlsx
downloaded = drive.CreateFile({'id':'1-UvqUpH-2pZV9_MS97Fuetp5E26U72VH'}) # replace the id with id of file you want to access
downloaded.GetContentFile('Rent for Dec 19_Annexure-5.xlsx')

import pandas as pd

#3. Read file as panda dataframe 

# Cosolidated sheet for Dec 2019_Annexure-3.xlsx
dfCosolidated_sheet_for_Dec_2019_Annexure_3 =  pd.read_excel('Cosolidated sheet for Dec 2019_Annexure-3.xlsx', sheet_name='Sheet1', skiprows=1)

# HLL Expenses Summary-Annexure-II.xlsx
dfhll_exp_sum_aII_CONSUMABLES =  pd.read_excel('HLL Expenses Summary-Annexure-II.xlsx', sheet_name='CONSUMABLES', skiprows=1)
dfhll_exp_sum_aII_RENT =  pd.read_excel('HLL Expenses Summary-Annexure-II.xlsx', sheet_name='RENT', skiprows=1)
dfhll_exp_sum_aII_THYROCARE =  pd.read_excel('HLL Expenses Summary-Annexure-II.xlsx', sheet_name='THYROCARE', skiprows=1)
dfhll_exp_sum_aII_PATHOLOGIST =  pd.read_excel('HLL Expenses Summary-Annexure-II.xlsx', sheet_name='PATHOLOGIST', skiprows=1)

# Lab Wise Business Report_Annexure-I.xls
dflab_wise_business_Ann_I =  pd.read_excel('Lab Wise Business Report_Annexure-I.xls')
dflab_wise_business_Ann_I=dflab_wise_business_Ann_I.drop([0])

# Rent for Dec 19_Annexure-5.xlsx
dfRentDec19_Annexure_5 =  pd.read_excel('Rent for Dec 19_Annexure-5.xlsx', sheet_name='Sheet1', skiprows=2)

# Datafram EXCEL sheet wise

```
# Cosolidated sheet for Dec 2019_Annexure-3.xlsx
  1. dfCosolidated_sheet_for_Dec_2019_Annexure_3
```
```
# HLL Expenses Summary-Annexure-II.xlsx
  2. dfhll_exp_sum_aII_CONSUMABLES
  3. dfhll_exp_sum_aII_RENT
  4. dfhll_exp_sum_aII_THYROCARE
  5. dfhll_exp_sum_aII_PATHOLOGIST
```
```
# Lab Wise Business Report_Annexure-I.xls
  6. dflab_wise_business_Ann_I
```
```
# Rent for Dec 19_Annexure-5.xlsx
  7.dfRentDec19_Annexure_5
```

In [4]:
#@title *Cosolidated sheet for Dec 2019_Annexure-3.xlsx* {display-mode: "form"}
dfCosolidated_sheet_for_Dec_2019_Annexure_3.head(2)

   Sr No.  User ID  ... Work From date Total Pay
0     1.0   9332.0  ...     15/02/2019    8000.0
1     2.0   9485.0  ...     05/03/2019    7500.0

[2 rows x 8 columns]

In [5]:
#@title *Cosolidated sheet for Dec 2019_Annexure-3.xlsx(info)* {display-mode: "form"}
dfCosolidated_sheet_for_Dec_2019_Annexure_3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3345 entries, 0 to 3344
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Sr No.          3339 non-null   float64
 1   User ID         3339 non-null   float64
 2   Designation     3339 non-null   object
 3   District        3339 non-null   object
 4   Lab             3339 non-null   object
 5   Resource Name   3341 non-null   object
 6   Work From date  3340 non-null   object
 7   Total Pay       3343 non-null   float64
dtypes: float64(3), object(5)
memory usage: 209.2+ KB

In [6]:
#@title *HLL Expenses Summary-Annexure-II.xlsx --Consumbles* {display-mode: "form"}
dfhll_exp_sum_aII_CONSUMABLES = dfhll_exp_sum_aII_CONSUMABLES.rename(columns={'Location': 'Lab'})
dfhll_exp_sum_aII_CONSUMABLES.head(2)

        Lab             Supplier Name  ... POSTING DATE Unnamed: 7
0  Kharghar  JAINAM/TULIP DIAGNOSTICS  ...   2019-05-23        NaN
1  Kharghar  JAINAM/TULIP DIAGNOSTICS  ...   2019-05-23        NaN

[2 rows x 8 columns]

In [7]:
#@title *HLL Expenses Summary-Annexure-II.xlsx (info) --Consumbles* {display-mode: "form"}
dfhll_exp_sum_aII_CONSUMABLES.info(2)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 181 entries, 0 to 180
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Lab            180 non-null    object
 1   Supplier Name  180 non-null    object
 2   PO No.         180 non-null    object
 3   Invoice No     180 non-null    object
 4   Invoice Amt    181 non-null    int64
 5   Invoice Date   180 non-null    datetime64[ns]
 6   POSTING DATE   127 non-null    datetime64[ns]
 7   Unnamed: 7     0 non-null      float64
dtypes: datetime64[ns](2), float64(1), int64(1), object(4)
memory usage: 11.4+ KB

In [8]:
#@title *HLL Expenses Summary-Annexure-II.xlsx --Rent* {display-mode: "form"}
dfhll_exp_sum_aII_RENT = dfhll_exp_sum_aII_RENT.rename(columns={'LAB LOCATION': 'Lab'})
dfhll_exp_sum_aII_RENT.head(2)

  SR .NO      Lab                       OWNERS NAME    DEC
0      1  MANCHAR            Namdev Dattatray Bende  18150
1      2  MANGAON  Mohammad Sharif Younus Harnekar   39930

In [9]:
#@title *HLL Expenses Summary-Annexure-II.xlsx (info)--Rent* {display-mode: "form"}
dfhll_exp_sum_aII_RENT.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 78 entries, 0 to 77
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   SR .NO       78 non-null     object
 1   Lab          77 non-null     object
 2   OWNERS NAME  77 non-null     object
 3   DEC          78 non-null     int64
dtypes: int64(1), object(3)
memory usage: 2.6+ KB

In [10]:
#@title *HLL Expenses Summary-Annexure-II.xlsx --Thyrocare* {display-mode: "form"}
dfhll_exp_sum_aII_THYROCARE = dfhll_exp_sum_aII_THYROCARE.rename(columns={'LOCATION': 'Lab'})
dfhll_exp_sum_aII_THYROCARE.head(2)

  Sr. No.         Lab  Sum of BILLED  Unnamed: 3
0       1    ACHALPUR       11118.01    11118.01
1       2  AHMEDNAGAR       15675.63         NaN

In [11]:
#@title *HLL Expenses Summary-Annexure-II.xlsx (info)--Thyrocare* {display-mode: "form"}
dfhll_exp_sum_aII_THYROCARE.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 106 entries, 0 to 105
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Sr. No.        106 non-null    object
 1   Lab            105 non-null    object
 2   Sum of BILLED  106 non-null    float64
 3   Unnamed: 3     94 non-null     float64
dtypes: float64(2), object(2)
memory usage: 3.4+ KB

In [12]:
#@title *HLL Expenses Summary-Annexure-II.xlsx --PATHOLOGIST* {display-mode: "form"}
dfhll_exp_sum_aII_PATHOLOGIST = dfhll_exp_sum_aII_PATHOLOGIST.rename(columns={'Lab Name': 'Lab'})
dfhll_exp_sum_aII_PATHOLOGIST.head(2)

   Sr. No     Employee Name  ...   DEC'19        JV NO.
0     1.0  Dr. Vijay Gawali  ...  80000.0  1.900201e+09
1     NaN               NaN  ...      NaN           NaN

[2 rows x 8 columns]

In [13]:
#@title *HLL Expenses Summary-Annexure-II.xlsx (info)--PATHOLOGIST* {display-mode: "form"}
dfhll_exp_sum_aII_PATHOLOGIST.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 142 entries, 0 to 141
Data columns (total 8 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Sr. No                  103 non-null    float64
 1   Employee Name           103 non-null    object
 2   Vendor Code             103 non-null    float64
 3   Designation             103 non-null    object
 4   Lab                     141 non-null    object
 5   Salary revision if any  142 non-null    float64
 6   DEC'19                  104 non-null    float64
 7   JV NO.                  103 non-null    float64
dtypes: float64(5), object(3)
memory usage: 9.0+ KB

In [14]:
#@title *Lab Wise Business Report_Annexure-I.xls* {display-mode: "form"}
dflab_wise_business_Ann_I = dflab_wise_business_Ann_I.rename(columns={'Lab Name': 'Lab'})
dflab_wise_business_Ann_I.head(2)

  Division Name District Name  ... Claim Amount  RejectedPatientcount
1      AMRAVATI         Akola  ...   2059433.68                   0.0
2      AMRAVATI         Akola  ...    500517.96                   0.0

[2 rows x 15 columns]

In [15]:
#@title *Lab Wise Business Report_Annexure-I.xls (info)* {display-mode: "form"}
dflab_wise_business_Ann_I.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 137 entries, 1 to 137
Data columns (total 15 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Division Name               137 non-null    object
 1   District Name               137 non-null    object
 2   Lab                         137 non-null    object
 3   Total Patient               137 non-null    int64
 4   Total Special               137 non-null    int64
 5   Total Normal                137 non-null    int64
 6   TAT MET                     137 non-null    int64
 7   TAT FAIL                    137 non-null    int64
 8   TAT MET %                   137 non-null    float64
 9   Total Revenue               137 non-null    float64
 10  Penalty(On Completed Test)  137 non-null    int64
 11  Penalty(On Pending Test)    137 non-null    int64
 12  Total Penalty               137 non-null    float64
 13  Claim Amount                137 non-null    float64
 14  RejectedPatientcount        137 non-null    float64
dtypes: float64(5), int64(7), object(3)
memory usage: 17.1+ KB

In [16]:
#@title *Rent for Dec 19_Annexure-5.xlsx - Sheet1* {display-mode: "form"}
dfRentDec19_Annexure_5 = dfRentDec19_Annexure_5.rename(columns={'Lab Location': 'Lab'})
dfRentDec19_Annexure_5.head(2)

   Sr.No.  ... Gross Rent
0     1.0  ...     7502.0
1     2.0  ...    14000.0

[2 rows x 6 columns]

In [17]:
#@title *Rent for Dec 19_Annexure-5.xlsx (info) - Sheet1* {display-mode: "form"}
dfRentDec19_Annexure_5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 66 entries, 0 to 65
Data columns (total 6 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Sr.No.                 65 non-null     float64
 1   District               61 non-null     object
 2   Lab                    65 non-null     object
 3   Owner                  65 non-null     object
 4   Owner account details  65 non-null     object
 5   Gross Rent             66 non-null     float64
dtypes: float64(2), object(4)
memory usage: 3.2+ KB

In [49]:
#@title *Create Master Dataframe,Distric and Lab wise unique data, drop null columns rows, Changes data to upper case* {display-mode: "form"}
dfCosolidated_sheet_for_Dec_2019_Annexure_3['District'] = dfCosolidated_sheet_for_Dec_2019_Annexure_3['District'].str.upper() 
dfCosolidated_sheet_for_Dec_2019_Annexure_3['Lab'] = dfCosolidated_sheet_for_Dec_2019_Annexure_3['Lab'].str.upper() 
dfCostingSheet=dfCosolidated_sheet_for_Dec_2019_Annexure_3.drop_duplicates(['District','Lab'])[['District','Lab']]
dfCostingSheet= dfCostingSheet.dropna()
dfCostingSheet.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 172 entries, 0 to 3181
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   District  172 non-null    object
 1   Lab       172 non-null    object
dtypes: object(2)
memory usage: 4.0+ KB

In [62]:
#@title *Master Dataframe - Reset index / Order by Lab* {display-mode: "form"}
pd.set_option('display.max_rows', dfCostingSheet.shape[0]+1)
dfCostingSheet.sort_values("Lab", axis = 0, ascending = True, 
                 inplace = True, na_position ='last')
dfCostingSheet.reset_index(drop=True, inplace=True)
print(dfCostingSheet)

        District                    Lab
0       AMRAVATI               ACHALPUR
1     AHMEDNAGAR             AHMADNAGAR
2           BEED             AHMADNAGAR
3        SOLAPUR               AKKALKOT
4      NANDURBAR              AKKALKUWA
5          AKOLA                  AKOLA
6          AKOLA                   AKOT
7          AKOLA                  AKOT
8           PUNE           AKURDI(PUNE)
9         RAIGAD                ALIBAUG
10    GADCHIROLI               ALLAPALI
11    GADCHIROLI              ALLPALLAI
12      AMRAVATI               AMRAVATI
13      YAVATMAL                   ARNI
14        WARDHA                   ARVI
15       SOLAPUR                 ATPADI
16        SANGLI                 ATPADI
17    AURANGABAD             AURANGABAD
18        SANGLI              BAMBAVADE
19      KOLHAPUR              BAMBAVADE
20         THANE              BAMBAVADE
21          PUNE               BARAMATI
22        SATARA               BARAMATI
23       SOLAPUR                 BARSHI
24     OSMANABAD                 BARSHI
25          BEED                   BEED
26      BHADGAON               BHADGAON
27       JALGAON               BHADGAON
28      BHANDARA               BHANDARA
29        NAGPUR               BHANDARA
30      BULDHANA               BULDHANA
31         JALNA               BULDHANA
32    CHANDRAPUR             CHANDRAPUR
33     RATNAGIRI                CHIPLUN
34       JALGAON                 CHOPDA
35       PALGHAR                 DAHANU
36        SATARA               DAHIWADI
37        GONDIA                  DEORI
38     NANDURBAR               DHADGAON
39        NANDED              DHARMABAD
40      AMRAVATI                 DHARNI
41         DHULE                  DHULE
42    GADCHIROLI             GADCHIROLI
43      KOLHAPUR             GADHINGLAJ
44        GONDIA                 GONDIA
45    CHANDRAPUR             GONDPIPARI
46        NANDED           HIMAYATNAGAR
47        WARDHA             HINGANGHAT
48       HINGOLI                HINGOLI
49          PUNE                INDAPUR
50       SOLAPUR                INDAPUR
51        SANGLI               ISLAMPUR
52        NANDED               ISLAMPUR
53         JALNA               JAFRABAD
54         JALNA                 JALANA
55       JALGAON                JALGAON
56         JALNA                  JALNA
57      BULDHANA                  JALNA
58    AHMEDNAGAR                JAMKHED
59          BEED                JAMKHED
60        SANGLI                    JAT
61        SANGLI                   JATH
62       PALGHAR                 JAWHAR
63    GADCHIROLI             JIMALGATTA
64      PARBHANI                 JINTUR
65          PUNE                 JUNNAR
66          PUNE                 JUNNER
67     OSMANABAD                 KALAMB
68     OSMANABAD                KALLAMB
69        NASHIK                 KALWAN
70    AURANGABAD                 KANNAD
71       JALGAON                 KANNAD
72        SATARA                  KARAD
73        SANGLI                  KARAD
74        WASHIM                KARANJA
75        RAIGAD                 KARJAT
76      BULDHANA               KHAMGAON
77        SATARA               KHANDALA
78        RAIGAD               KHARGHAR
79     RATNAGIRI                   KHED
80        NANDED                 KINWAT
81      KOLHAPUR               KOLHAPUR
82    CHANDRAPUR     KORPANA/GADCHANDUR
83    SINDHUDURG                  KUDAL
84      KOLHAPUR                    KUR
85    GADCHIROLI               KURKHEDA
86         LATUR                  LATUR
87         LATUR                 LATUR
88     OSMANABAD                 LATUR
89   MUMBAI CITY            LOWER PAREL
90         THANE            LOWER PAREL
91        RAIGAD                  MAHAD
92          BEED              MAJALGAON
93        NASHIK               MALEGAON
94          PUNE                MANCHAR
95        RAIGAD                MANGAON
96          BEED             MANJLEGAON
97        NASHIK                 MANMAD
98         JALNA                 MANTHA
99      BULDHANA                MEHAKAR
100     BULDHANA                 MEHKAR
101       NANDED                 MUKHED
102      JALGAON            MUKTAINAGAR
103        AKOLA             MURTIZAPUR
104   CHANDRAPUR                NAGBHID
105       NAGPUR                 NAGPUR
106     PARBHANI                 NANDED
107       NANDED                 NANDED
108      HINGOLI                 NANDED
109    NANDURBAR              NANDURBAR
110       NASHIK                 NASHIK
111    NANDURBAR                NAVAPUR
112     KOLHAPUR                 NESARI
113        LATUR                NILANGA
114    OSMANABAD                 OMERGA
115    OSMANABAD              OSMANABAD
116      PALGHAR                PALGHAR
117     YAVATMAL          PANDHARKAWADA
118     YAVATMAL  PANDHARKHAWAD/KELAPUR
119      SOLAPUR             PANDHARPUR
120     PARBHANI                 PARALI
121         BEED                 PARALI
122     PARBHANI               PARBHANI
123         PUNE                   PAUD
124         PUNE                   PUNE
125     YAVATMAL                  PUSAD
126         PUNE            RAJGURNAGAR
127         PUNE           RAJGURUNAGAR
128       NAGPUR                 RAMTEK
129    RATNAGIRI              RATNAGIRI
130       RAIGAD               RAVDANDA
131        DHULE                  SAKRI
132   AHMEDNAGAR              SANGAMNER
133     KOLHAPUR                 SANGLI
134       SANGLI                 SANGLI
135       SATARA                 SATARA
136   SINDHUDURG             SAWANTWADI
137    NANDURBAR                SHAHADA
138        THANE               SHAHAPUR
139      PALGHAR               SHAHAPUR
140   AHMEDNAGAR               SHEVGAON
141        DHULE                SHIRPUR
142   AHMEDNAGAR                 SHIRUR
143         PUNE                 SHIRUR
144         PUNE              SHRIGONDA
145   AHMEDNAGAR              SHRIGONDA
146   AURANGABAD                 SILLOD
147   CHANDRAPUR              SINDEWAHI
148   GADCHIROLI               SIRONCHA
149      SOLAPUR                SOLAPUR
150       NASHIK                SURGANA
151         PUNE               SWARGATE
152   SINDHUDURG                 TALERE
153        THANE                  THANE
154       RAIGAD                  THANE
155       NASHIK                TRIMBAK
156    OSMANABAD               TULJAPUR
157      SOLAPUR               TULJAPUR
158     BHANDARA                 TUMSAR
159       GONDIA                 TUMSAR
160        LATUR                  UDGIR
161    OSMANABAD                 UMERGA
162        LATUR                 UMERGA
163   AHMEDNAGAR               VAIJAPUR
164   AURANGABAD               VAIJAPUR
165      PALGHAR                  VIRAR
166        THANE                  VIRAR
167       WARDHA                 WARDHA
168   CHANDRAPUR                 WARORA
169     AMRAVATI                  WARUD
170       WASHIM                 WASHIM
171     YAVATMAL               YAVATMAL

**Same "Lab Name" found in multiple distinct**

```
161    OSMANABAD                 UMERGA
162        LATUR                 UMERGA
163   AHMEDNAGAR               VAIJAPUR
164   AURANGABAD               VAIJAPUR
165      PALGHAR                  VIRAR
166        THANE                  VIRAR
```